/*--------------------------------------------------------------------------------------------------*/
/*                                      1002.写出这个数（20）                                       */
/*                                                                                                  */
/* 读入一个自然数N，计算其各位数字之和，用汉语拼音写出和的每一位数字。                              */
/* 输入格式：每个测试输入包含1个测试用用例，即给出自然数N的值。这里保证N小10的100次方。             */
/* 输出格式：在一行内输出N的各位数字之和的每一位，拼音数字间有1空格，但最后一个拼音数字后没有空格。 */
/* 输入样例:1234567890987654321123456789                                                            */
/* 输出样例：yi san wu                                                                              */
/*--------------------------------------------------------------------------------------------------*/
/* 作业者：愣头小兵     E-mail:ltxb@qq.com    日期：2017年4月8日     地点：上海                     */
/*--------------------------------------------------------------------------------------------------*/

# include<stdio.h>

int OutNumber(char*);

int main()
{
    char str[101];
    scanf("%s",str);
    OutNumber(str);
    return 0;
}


int OutNumber(char* a)
{
    char output[10][5]={"ling","yi","er","san","si","wu","liu","qi","ba","jiu"};
    int i=0,sum=0;
    int num[3];

    while(a[i]!='\0')               
    {
       sum=sum+a[i]-'0';
       i++;
    }

    i=0;
    do
    {
       num[i]=sum%10;
       sum=sum/10;
       i++;
    }while(sum!=0);
    i--;

    while(i>=0)
    {
       if(i==0)
           printf("%s",&(output[num[i]][0]));
       else
           printf("%s ",&(output[num[i]][0]));
       i--;
    }
} 

