/*-----------------------------------------------------------------------------------------------*/
/*                                1006.换个格式输出整数（15）                                    */
/* 让我们用字B来表示“百”、字母S表示“十”，用“12...n”来表示个位数字N(<10)，换个格式来输出任一个不超*/
/* 过3位数的正整数。例如234应该被输出为BBSSS1234,因为它有2个“百”、3个“十”、以及个位的4.          */
/* 输入格式：每个测试输入包含1个测试用例，给出正整数(<1000)。                                    */
/* 输出格式：每个测试用例的输出占一行，用规定的格式输出n。                                       */
/* 输入样例1：                                                                                   */
/* 234                                                                                           */
/* 输出样例1：                                                                                   */
/* BBSSS1234                                                                                     */
/* 输入样例2：                                                                                   */
/* 23                                                                                            */
/* 输出样例2：                                                                                   */
/* SS123                                                                                         */
/*-----------------------------------------------------------------------------------------------*/
/*作业者：愣头小兵  E-mail:ltxb@qq.com    作业日期：2017年4月15日      地点：上海                */
/*-----------------------------------------------------------------------------------------------*/

#include<stdio.h>

void FormatOutput(int);

int main()
{
    int n;
    scanf("%d",&n);
    FormatOutput(n);
    return 0;
}

void FormatOutput(int n)
{
    int a[3]={0,0,0};
    int i=2,j=1;
    if(n<=0||n>=1000)
        printf("输入数字不符合要求，应是小于1000的正整数!\n");
    else
    {
        while(n!=0)
        {
           a[i]=n%10;
           n=n/10;
           i--;
        }

        for(i=0;i<3;i++)
        {
            while(a[i]>0)
	    {
	       if(i==0)
                   printf("B");
               else if(i==1)
                   printf("S");
               else
               {
                   printf("%d",j);
                   j++;
               }
               a[i]--;
            }
         }
      }
}
