/*
----------------------------------------------------------------------------------------------------
                                      1011.A+B和C(15)
    给定区间[-2的31次方，2的31次方]内的3个整数A,B和C，请判断A+B是否大于C。
    输入格式：
    输入第1行给出正整数T(<=10),是测试用例的个数。随后给出T组测试用例，每组占一行，顺序给出A,B和c。整
数间以空格分隔。
    输出格式：
    对每组测试用例，如果A+B>C，则在一行中输出“Case #1:true”，否则输出"Case #X:flase",其中X是测试用例
的编号(从1开始)。
    输入样例：
    4
    1 2 3
    2 3 4
    2147483647 0 2147483646
    0 -2147483648 -2147483647
    输出样例：
    Case #1:false
    Case #2:true
    Case #3:true
    Case #4:false
----------------------------------------------------------------------------------------------------
    作业者：愣头小兵   E-mail:ltxb@qq.com  日期：2017年4月20日    地点：上海
----------------------------------------------------------------------------------------------------
*/

#include<stdio.h>

int main()
{
    int n,i;
    scanf("%d",&n);
    int a[n][3];
    for(i=0;i<n;i++)
        scanf("%d %d %d",&a[i][0],&a[i][1],&a[i][2]);
    
    for(i=0;i<n;i++)
    {
        printf("Case #%d:",i+1);
        if((a[i][0]+a[i][1])>a[i][2])
            printf("true\n");
        else
            printf("false\n");
    }
    
    return 0;
}
