/*
----------------------------------------------------------------------------------------------------
                              1012.数字分类(20)
    给定一系列正整数，请按要求对数字进行分类，并输出以下5个数字：
    -A1=能被5整除的数字中所有偶数的和;
    -A2=将被5除后余1的数字按给出顺序进行交错求和，即计算n1-n2+n3-n4....;
    -A3=被5除后余2的数字的个数；
    -A4=被5除后余3的数字的平均数，精确到小数点后1位;
    -A5=被5除后余4的数字中的最大数字。
    输入格式：
    每个输入包含1个测试用例。每个测试用例先给出一个不超过1000的正整数n，随后给出N个不超过1000的待分
类的正整数。数字以空格分隔。
    输出格式：
    对给定的N个正整数，按题目要求计算A1～A5并在一行中顺序输出。数字间以空格分隔，行末不得有多余空格。
    若其中某一类数字不存在，则在相应位置输出“N”。
    输入样例1：
    13 1 2 3 4 5 6 7 8 9 10 20 16 18
    输出样例1：
    30 11 2 9.7 9
    输入样例2：
    8 1 2 4 5 6 7 9 16
    输出样例2：
    N 11 2 N 9
----------------------------------------------------------------------------------------------------
    作业者：愣头小兵    E-mail:ltxb@qq.com    日期：2007年4月20日      地点：上海
----------------------------------------------------------------------------------------------------
*/

#include<stdio.h>

void Print(int,int,int);

int main()
{
    int a[5]={0},flag[5]={0};
    int n,i,sign=-1;
    scanf("%d",&n);
    int b[n];

    for(i=0;i<n;i++)
    {
        scanf("%d",&b[i]);
        if(b[i]%10==0)
        {
            flag[0]++;
            a[0]=a[0]+b[i];
        }
        else if(b[i]%5==1)
        {
            flag[1]++;
            sign=-sign;
            a[1]=a[1]+sign*b[i];
        }
        else if(b[i]%5==2)
        {
            flag[2]++;
            a[2]++;
        }
        else if(b[i]%5==3)
        {
            flag[3]++;
            a[3]=a[3]+b[i];
        }
        else if(b[i]%5==4)
        {
            flag[4]++;
            if(flag[4]==1)
                a[4]=b[i];
            else if(b[i]>a[4])
                a[4]=b[i];
        }
    }
    
    Print(a[0],flag[0],0);
    for(i=1;i<=4;i++)
    {
        printf(" ");
        Print(a[i],flag[i],i);
    }
    
    return 0;
}
     
void Print(int a,int f,int k)
{
        if(k==3)
        {
            if(f==0)
                printf("N");
            else
                printf("%.1f",(1.0*a)/(f*1.0));
        }
        else
        {
            if(f==0)
                printf("N");
            else
                printf("%d",a);
        }
}
            
