/*
----------------------------------------------------------------------------------------------------
                                          1013.数素数(20)
    令Pi表示第i个素数。现任给两个正整数M<=N<=10000,请输出Pm到Pn的所有素数。
    输入格式:
    输入在一行中给出M和N，其间以空格分隔。
    输出格式：
    输出从Pm到Pn的所有素数，每10个数字占1行，其间以空格分隔，但行末不得有多余空格。
    输入样例：
    5 27
    输出样例：
    11 13 17 19 23 29 31 41 43
    47 53 59 61 71 73 79 83 89
    97 101 103
----------------------------------------------------------------------------------------------------
    作业者：愣头小兵    E-mail:ltxb@qq.com    日期：2017年4月21日      地点：上海
----------------------------------------------------------------------------------------------------
*/

#include <stdio.h>
#include<math.h>

int IsPrime(int n);      //判定N是否为素数，是返回1,不是返回0

int main()
{
    int m,n,i=2,flag=1;
    scanf("%d %d",&m,&n);
    
    while(flag<=n)
    {
        if(IsPrime(i)==1)
        {
            if(flag>=m)
            {
                if((flag-m+1)%10==0&&flag>=m)
                    printf("%d\n",i);
                else if(flag==n)
                    printf("%d",i);
                else
                    printf("%d ",i);
            }
            flag++;
        }
        i++;
    }

    return 0;
}

int IsPrime(int n)
{
    int i,isPri=1;
    double k=sqrt(n);
    for(i=2;i<=k;i++)
    {
        if(n%i==0)
        {
            isPri=0;
            break;
        }
    }
    return isPri;
}
  
