/*
----------------------------------------------------------------------------------------------------
                                         1016.部分A+B(15)
    正整数A的“DA（为1位整数）部分”定义为由A中所有DA组成的新整数PA。例如：给定A=3862767,DA=6,则A的“6
部分”PA是66,因为A中有2个6。
    现给定A、DA、B、DB，请编写程序计算PA+PB。
    输入格式：输入在一行中依次给出A、DA、B、DB，中间以空格分隔，其中0<A,B<10000000000。
    输出格式：在一行中输出PA+PB的值。
    输入样例1：
    3862767 6 13530293 3
    输出样例1：
    399
    输入样例2：
    3862767 1 13530293 8
    输出样例2：
    6
----------------------------------------------------------------------------------------------------
    作业者：愣头小兵    E-mail:ltxb@qq.com    日期：2017年4月27日     地点：上海
----------------------------------------------------------------------------------------------------
*/

#include<stdio.h>
#include<string.h>

int ComputeP(char *a,char da);    //已知A，DA，求出PA

int main()
{
    int A,B,sum;
    char a[11],b[11];
    char da,db;
    scanf("%s %c %s %c",a,&da,b,&db);
    
    A=ComputeP(a,da);
    B=ComputeP(b,db);
    sum=A+B;
    
    printf("%d",sum);
    
    return 0;
}

int  ComputeP(char *a,char da)
{
    int i,j,len;
    int sum=0,tem=1;

    len=strlen(a);
    for(i=0;i<len;i++)
    {
        if(a[i]==da)
        {
            sum=sum+tem*(da-'0');
            tem=tem*10;
        }
    }
    
    return sum;
}
